{
    "pages": [
        {
            "name": "About Us",
            "text": "The Center for Gender, Sexuality, and Activism (CGSA) at Boston University is a student-led space committed to fostering inclusion, equality, and social justice for individuals of all genders and sexualities. Guided by a social justice framework, the CGSA works to dismantle systems of gender-based oppression and violence, advocating for the full empowerment and representation of women, queer, and trans students. Through dynamic community-building, the CGSA promotes open and challenging dialogue, supports student activism, and provides essential resources, education, and programming to cultivate awareness and drive meaningful change within the Boston University community and beyond. E-Board Seheni Kariyawasan (she/her) Director Morgan Brennan (she/her) Student Orgs Coordinator Jiline Foote (she/they) Social Media Coordinator Yihsi Huang (she/her) Volunteer Coordinator Tania Torres (she/her) Space Coordinator Akaash Khurana (he/him) Treasurer"
        },
        {
            "name": "Blog",
            "text": "The Center for Gender, Sexuality, and Activism (CGSA) at Boston University is more than just a space—it's a movement. Rooted in a commitment to social justice, the CGSA empowers students to challenge oppression, build community, and advocate for equality across all genders and sexualities. In this blog, we’ll explore the stories, initiatives, and impact of this vital student-led organization, showcasing how it continues to inspire change both on campus and beyond."
        },
        {
            "name": "Contact Us",
            "text": "There are lots of ways to get in touch with us! George Sherman Union 775 Commonwealth Ave. Basement Floor Boston, MA 02215 Mailing address: 1 University Way c/o Student Activities Office Boston, MA 02215 Phone: (617) 358-5575 Email: cgsa@bu.edu Find us on social media on Twitter and Instagram! Click here to contact us!"
        },
        {
            "name": "Home",
            "text": "The Center for Gender, Sexuality and Activism (CGSA) at Boston University strives to be a safe space for people of all genders and sexualities. Using a social justice framework, the CGSA aims to end gender oppression and violence, and advocates for the full equality and inclusion of women, queer and trans students. Our dynamic community fosters challenging and open discourse, promotes student activism, and provides resources and education for the Boston University community."
        },
        {
            "name": "Newsletter Sign-Up",
            "text": "Placeholder"
        },
        {
            "name": "Resources",
            "text": "GARB: Gender Affirming Room for Belonging Who can use GARB? GARB is a free closet for transgender/gender non-conforming BU students. Anyone who wishes to experiment with or affirm their gender can use GARB and take products home. How do I use GARB? The best way to use GARB is however it makes you comfortable. Take home some products, try on clothes or jewelry, practice your makeup skills, and explore your identity. There is no sign up process and you don’t need to write down what you take. Questions or Comments Please see a volunteer at the front desk at the CGSA Space or email cgsa@bu.edu. If you have suggestions or comments, feel free to leave us a note in the suggestion box! Can I have some privacy? Of course! GARB is also available as a safe, private space where students can lock the door and try on any clothes, makeup, or other products to explore their gender identity and expression. Library The CGSA’s very own library collection. Currently installing a checkout system. Wellness Room Destress and unplug in our wellness room. Take a nap, watch a movie, and get centered. Other Resources Menstrual Products Tampons Pads Safe Sex Supplies Condoms Internal Condoms Lube Packets Dental Dams Hygiene Products Travel-Size Snacks Kept in kitchen cabinet"
        },
        {
            "name": "Space Booking Form",
            "text": "Placeholder"
        },
        {
            "name": "Volunteer Sign-Up",
            "text": "Placeholder"
        }
    ]
}